results/2026-07-09_v8_tuning/qwen3-30b-a3b-bf16/chunk16384_cap128/toolagent/bench.log
benchmark_args=Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31221, dataset_name='mooncake', dataset_path='', model='/data/hf/models/Qwen3-30B-A3B-Instruct-2507', served_model_name=None, tokenizer=None, num_prompts=2000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v8_tuning/qwen3-30b-a3b-bf16/chunk16384_cap128/toolagent/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=0.1, mooncake_num_rounds=1, mooncake_workload='toolagent', tag=None, header=None)
Namespace(backend='sglang', base_url=None, host='127.0.0.1', port=31221, dataset_name='mooncake', dataset_path='', model='/data/hf/models/Qwen3-30B-A3B-Instruct-2507', served_model_name=None, tokenizer=None, num_prompts=2000, sharegpt_output_len=None, sharegpt_context_len=None, random_input_len=1024, random_output_len=1024, random_range_ratio=0.0, image_count=1, image_resolution='1080p', random_image_count=False, image_format='jpeg', image_content='random', request_rate=inf, use_trace_timestamps=False, max_concurrency=128, output_file='/home/t-jialianggu/work/EndtoEnd-auto-optimization/results/2026-07-09_v8_tuning/qwen3-30b-a3b-bf16/chunk16384_cap128/toolagent/bench_serving_result.jsonl', output_details=False, print_requests=False, disable_tqdm=False, disable_stream=False, return_logprob=False, return_routed_experts=False, seed=1, disable_ignore_eos=False, extra_request_body=None, apply_chat_template=False, profile=False, plot_throughput=False, profile_activities=['CPU', 'GPU'], profile_num_steps=None, profile_by_stage=False, profile_stages=None, profile_output_dir=None, profile_prefix=None, lora_name=None, lora_request_distribution='uniform', lora_zipf_alpha=1.5, prompt_suffix='', pd_separated=False, profile_prefill_url=None, profile_decode_url=None, flush_cache=False, warmup_requests=1, tokenize_prompt=False, gsp_num_groups=64, gsp_prompts_per_group=16, gsp_system_prompt_len=2048, gsp_question_len=128, gsp_output_len=256, gsp_range_ratio=1.0, gsp_fast_prepare=False, gsp_send_routing_key=False, gsp_num_turns=1, gsp_ordered=False, mooncake_slowdown_factor=0.1, mooncake_num_rounds=1, mooncake_workload='toolagent', tag=None, header=None)

Starting warmup with 1 sequences...
Warmup completed with 1 sequences. Starting main benchmark run...
Using time-based Mooncake request scheduler, ignoring --request-rate.
Starting Mooncake trace replay. Sessions: 2000, Rounds per session: 1. Slowdown factor: 0.1
100%|██████████| 2000/2000 [02:50<00:00, 11.74it/s]

============ Serving Benchmark Result ============
Backend:                                 sglang    
Traffic request rate:                    inf       
Max request concurrency:                 128       
Successful requests:                     2000      
Benchmark duration (s):                  170.43    
Total input tokens:                      5072672   
Total input text tokens:                 5072672   
Total generated tokens:                  371759    
Total generated tokens (retokenized):    371679    
Request throughput (req/s):              11.74     
Input token throughput (tok/s):          29764.77  
Output token throughput (tok/s):         2181.36   
Peak output token throughput (tok/s):    4336.00   
Peak concurrent requests:                156       
Total token throughput (tok/s):          31946.13  
Concurrency:                             119.94    
----------------End-to-End Latency----------------
Mean E2E Latency (ms):                   10220.56  
Median E2E Latency (ms):                 2362.42   
P90 E2E Latency (ms):                    28260.03  
P99 E2E Latency (ms):                    44502.72  
---------------Time to First Token----------------
Mean TTFT (ms):                          220.09    
Median TTFT (ms):                        106.75    
P99 TTFT (ms):                           1591.46   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          77.09     
Median TPOT (ms):                        52.66     
P99 TPOT (ms):                           985.73    
---------------Inter-Token Latency----------------
Mean ITL (ms):                           54.09     
Median ITL (ms):                         34.71     
P95 ITL (ms):                            147.83    
P99 ITL (ms):                            510.19    
Max ITL (ms):                            4263.63   
==================================================